# Базы данных

## Темы для изучения
Базы данных. Реляционные базы данных. ACID. CAP-теорема.
Виды NoSQL-хранилищ.
Индексы. Типы индексов. Репликация: физическая и логическая. 
Партицирование. 
Нормализация и денормализация БД.
Балансировка запросов: pgbouncer/ odissey. Режим работы балансировщика.
Оптимистичные и пессимистичные блокировки.
VACUUM. Оптимизация запросов при помощи EXPLAIN.

## Материалы для подготовки
.....

## Упражнение


## Вопросы для менторской сессии
* Что такое ACID? Какие уровни изоляции транзакций есть в PostgreSQL?
* Какие типы NoSQL хранилищ можешь назвать? 
* Какие типа индексов существует 6в PostgreSQL?
* Чем отличается логическая и физическая репликация? 
* В чем отличие сессионного и транзакционного режима работы балансировщика?
* Как реализовать оптимистичную блокировку? В каких случаях она применяется? А пессимистичную?
* Чем отличается EXPLAIN от EXPLAIN ANALYZE?

## Задачи для менторской сессии
* Вопрос про оптимальный индекс для запроса
